[
    {
        "id": 1,
        "name": "Emma & Bella",
        "review": "Bella loved her grooming session! The staff was incredibly gentle and caring. They made sure Bella felt calm during the entire process, using soft brushes and natural shampoos. After her grooming, Bella looked shiny, clean, and smelled amazing! It’s clear that the team treats every pet like family. I especially loved how they added a warm towel wrap for her after the bath — such a thoughtful touch during the cold season!",
        "image": "https://i.ibb.co.com/4nXRBH0Q/images-q-tbn-ANd9-Gc-S9g-XNrso-Ax-IS3-LLlo7k42z-Bi-Jg5k-DYkhlt-Aji8ow-PCe-JNj-YZGSBXM2-Vj-Hh-Zmi-S2c.jpg"
    },
    {
        "id": 2,
        "name": "John & Max",
        "review": "Excellent winter care tips! Max feels cozy and happy indoors now. The team guided me on adjusting his diet and helped me pick out a perfect heated mat for his sleeping area. Their winter care plan really made a difference — Max’s paws are healthy, and he’s more active and playful. I also appreciate the staff’s follow-up advice on how to maintain indoor humidity for pets during winter. Top-notch service all around!",
        "image": "https://i.ibb.co.com/q34NyPCC/117964-directoryimage.jpg"
    },
    {
        "id": 3,
        "name": "Sophia & Luna",
        "review": "Loved the pet-friendly fireplace setup — Luna can’t stop napping there! The CozyTails Hub staff helped me choose the perfect heated bed and even gave tips on keeping her fur healthy. Luna is usually picky about her resting spots, but now she curls up by the fire all day. The service was quick, affordable, and clearly run by passionate pet lovers. I’ve recommended them to all my fellow cat parents!",
        "image": "https://i.ibb.co.com/rGLntTSJ/T08-FHNv-show-poster2x3-ZDe-Hg-ES.jpg"
    },
    {
        "id": 4,
        "name": "Daniel & Rocky",
        "review": "Rocky used to get anxious during baths, but this team completely changed that! The environment was warm, quiet, and filled with friendly faces. They used special winter-safe shampoos and blow-dried him gently so he wouldn’t catch a chill. Now, Rocky actually enjoys bath time! I can’t thank them enough for making our big boy comfortable and happy. Highly recommend for large dog owners who want stress-free care!",
        "image": "https://i.ibb.co.com/mVBkX8D2/2cd463e65b85c3cb85e0d4dbb7b708d63f4a83535826ab0022d3e0eb292b7a98.jpg"
    },
    {
        "id": 5,
        "name": "Mia & Coco",
        "review": "Coco absolutely adores her new winter coat from the CozyTails clothing section! The staff helped me find the perfect fit that’s both warm and stylish. Now, every walk feels like a mini fashion show. The material is soft yet durable, and I love how it keeps her chest protected from the cold wind. Their attention to detail and love for pets is unmatched — worth every penny!",
        "image": "https://i.ibb.co.com/DHTS6WFB/images-q-tbn-ANd9-Gc-Twm7-Zvvr4-Xhx-WRdcsv-Lxjk7e0-I7gvh-O4-OSg-s.jpg"
    }
]